Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/include/component/tamper.h
/*
 * Component description for TAMPER
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-07-07T23:00:11Z */
#ifndef _PIC32CZCA90_TAMPER_COMPONENT_H_
#define _PIC32CZCA90_TAMPER_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR TAMPER                                       */
/* ************************************************************************** */

/* -------- TAMPER_LEVELA : (TAMPER Offset: 0x00) ( R/ 32) Level A -------- */
#define TAMPER_LEVELA_RESETVALUE              _UINT32_(0x11111115)                                 /*  (TAMPER_LEVELA) Level A  Reset Value */

#define TAMPER_LEVELA_LEVEL0_Pos              _UINT32_(0)                                          /* (TAMPER_LEVELA) Level 0 Position */
#define TAMPER_LEVELA_LEVEL0_Msk              (_UINT32_(0xF) << TAMPER_LEVELA_LEVEL0_Pos)          /* (TAMPER_LEVELA) Level 0 Mask */
#define TAMPER_LEVELA_LEVEL0(value)           (TAMPER_LEVELA_LEVEL0_Msk & (_UINT32_(value) << TAMPER_LEVELA_LEVEL0_Pos)) /* Assigment of value for LEVEL0 in the TAMPER_LEVELA register */
#define   TAMPER_LEVELA_LEVEL0_NONE_Val       _UINT32_(0x0)                                        /* (TAMPER_LEVELA) No Action  */
#define   TAMPER_LEVELA_LEVEL0_HOSTIRQ_Val    _UINT32_(0x1)                                        /* (TAMPER_LEVELA) Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL0_LEHIRQ_Val     _UINT32_(0x2)                                        /* (TAMPER_LEVELA) Log Event and Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL0_SAFEMODE_Val   _UINT32_(0x4)                                        /* (TAMPER_LEVELA) Enter Safe Mode  */
#define   TAMPER_LEVELA_LEVEL0_ERSTKEY_Val    _UINT32_(0x5)                                        /* (TAMPER_LEVELA) Erase Tamper Key  */
#define   TAMPER_LEVELA_LEVEL0_ERSFKEY_Val    _UINT32_(0x6)                                        /* (TAMPER_LEVELA) Erase Flash Key  */
#define TAMPER_LEVELA_LEVEL0_NONE             (TAMPER_LEVELA_LEVEL0_NONE_Val << TAMPER_LEVELA_LEVEL0_Pos) /* (TAMPER_LEVELA) No Action Position  */
#define TAMPER_LEVELA_LEVEL0_HOSTIRQ          (TAMPER_LEVELA_LEVEL0_HOSTIRQ_Val << TAMPER_LEVELA_LEVEL0_Pos) /* (TAMPER_LEVELA) Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL0_LEHIRQ           (TAMPER_LEVELA_LEVEL0_LEHIRQ_Val << TAMPER_LEVELA_LEVEL0_Pos) /* (TAMPER_LEVELA) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL0_SAFEMODE         (TAMPER_LEVELA_LEVEL0_SAFEMODE_Val << TAMPER_LEVELA_LEVEL0_Pos) /* (TAMPER_LEVELA) Enter Safe Mode Position  */
#define TAMPER_LEVELA_LEVEL0_ERSTKEY          (TAMPER_LEVELA_LEVEL0_ERSTKEY_Val << TAMPER_LEVELA_LEVEL0_Pos) /* (TAMPER_LEVELA) Erase Tamper Key Position  */
#define TAMPER_LEVELA_LEVEL0_ERSFKEY          (TAMPER_LEVELA_LEVEL0_ERSFKEY_Val << TAMPER_LEVELA_LEVEL0_Pos) /* (TAMPER_LEVELA) Erase Flash Key Position  */
#define TAMPER_LEVELA_LEVEL1_Pos              _UINT32_(4)                                          /* (TAMPER_LEVELA) Level 1 Position */
#define TAMPER_LEVELA_LEVEL1_Msk              (_UINT32_(0xF) << TAMPER_LEVELA_LEVEL1_Pos)          /* (TAMPER_LEVELA) Level 1 Mask */
#define TAMPER_LEVELA_LEVEL1(value)           (TAMPER_LEVELA_LEVEL1_Msk & (_UINT32_(value) << TAMPER_LEVELA_LEVEL1_Pos)) /* Assigment of value for LEVEL1 in the TAMPER_LEVELA register */
#define   TAMPER_LEVELA_LEVEL1_NONE_Val       _UINT32_(0x0)                                        /* (TAMPER_LEVELA) No Action  */
#define   TAMPER_LEVELA_LEVEL1_HOSTIRQ_Val    _UINT32_(0x1)                                        /* (TAMPER_LEVELA) Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL1_LEHIRQ_Val     _UINT32_(0x2)                                        /* (TAMPER_LEVELA) Log Event and Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL1_SAFEMODE_Val   _UINT32_(0x4)                                        /* (TAMPER_LEVELA) Enter Safe Mode  */
#define   TAMPER_LEVELA_LEVEL1_ERSTKEY_Val    _UINT32_(0x5)                                        /* (TAMPER_LEVELA) Erase Tamper Key  */
#define   TAMPER_LEVELA_LEVEL1_ERSFKEY_Val    _UINT32_(0x6)                                        /* (TAMPER_LEVELA) Erase Flash Key  */
#define TAMPER_LEVELA_LEVEL1_NONE             (TAMPER_LEVELA_LEVEL1_NONE_Val << TAMPER_LEVELA_LEVEL1_Pos) /* (TAMPER_LEVELA) No Action Position  */
#define TAMPER_LEVELA_LEVEL1_HOSTIRQ          (TAMPER_LEVELA_LEVEL1_HOSTIRQ_Val << TAMPER_LEVELA_LEVEL1_Pos) /* (TAMPER_LEVELA) Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL1_LEHIRQ           (TAMPER_LEVELA_LEVEL1_LEHIRQ_Val << TAMPER_LEVELA_LEVEL1_Pos) /* (TAMPER_LEVELA) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL1_SAFEMODE         (TAMPER_LEVELA_LEVEL1_SAFEMODE_Val << TAMPER_LEVELA_LEVEL1_Pos) /* (TAMPER_LEVELA) Enter Safe Mode Position  */
#define TAMPER_LEVELA_LEVEL1_ERSTKEY          (TAMPER_LEVELA_LEVEL1_ERSTKEY_Val << TAMPER_LEVELA_LEVEL1_Pos) /* (TAMPER_LEVELA) Erase Tamper Key Position  */
#define TAMPER_LEVELA_LEVEL1_ERSFKEY          (TAMPER_LEVELA_LEVEL1_ERSFKEY_Val << TAMPER_LEVELA_LEVEL1_Pos) /* (TAMPER_LEVELA) Erase Flash Key Position  */
#define TAMPER_LEVELA_LEVEL2_Pos              _UINT32_(8)                                          /* (TAMPER_LEVELA) Level 2 Position */
#define TAMPER_LEVELA_LEVEL2_Msk              (_UINT32_(0xF) << TAMPER_LEVELA_LEVEL2_Pos)          /* (TAMPER_LEVELA) Level 2 Mask */
#define TAMPER_LEVELA_LEVEL2(value)           (TAMPER_LEVELA_LEVEL2_Msk & (_UINT32_(value) << TAMPER_LEVELA_LEVEL2_Pos)) /* Assigment of value for LEVEL2 in the TAMPER_LEVELA register */
#define   TAMPER_LEVELA_LEVEL2_NONE_Val       _UINT32_(0x0)                                        /* (TAMPER_LEVELA) No Action  */
#define   TAMPER_LEVELA_LEVEL2_HOSTIRQ_Val    _UINT32_(0x1)                                        /* (TAMPER_LEVELA) Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL2_LEHIRQ_Val     _UINT32_(0x2)                                        /* (TAMPER_LEVELA) Log Event and Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL2_SAFEMODE_Val   _UINT32_(0x4)                                        /* (TAMPER_LEVELA) Enter Safe Mode  */
#define   TAMPER_LEVELA_LEVEL2_ERSTKEY_Val    _UINT32_(0x5)                                        /* (TAMPER_LEVELA) Erase Tamper Key  */
#define   TAMPER_LEVELA_LEVEL2_ERSFKEY_Val    _UINT32_(0x6)                                        /* (TAMPER_LEVELA) Erase Flash Key  */
#define TAMPER_LEVELA_LEVEL2_NONE             (TAMPER_LEVELA_LEVEL2_NONE_Val << TAMPER_LEVELA_LEVEL2_Pos) /* (TAMPER_LEVELA) No Action Position  */
#define TAMPER_LEVELA_LEVEL2_HOSTIRQ          (TAMPER_LEVELA_LEVEL2_HOSTIRQ_Val << TAMPER_LEVELA_LEVEL2_Pos) /* (TAMPER_LEVELA) Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL2_LEHIRQ           (TAMPER_LEVELA_LEVEL2_LEHIRQ_Val << TAMPER_LEVELA_LEVEL2_Pos) /* (TAMPER_LEVELA) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL2_SAFEMODE         (TAMPER_LEVELA_LEVEL2_SAFEMODE_Val << TAMPER_LEVELA_LEVEL2_Pos) /* (TAMPER_LEVELA) Enter Safe Mode Position  */
#define TAMPER_LEVELA_LEVEL2_ERSTKEY          (TAMPER_LEVELA_LEVEL2_ERSTKEY_Val << TAMPER_LEVELA_LEVEL2_Pos) /* (TAMPER_LEVELA) Erase Tamper Key Position  */
#define TAMPER_LEVELA_LEVEL2_ERSFKEY          (TAMPER_LEVELA_LEVEL2_ERSFKEY_Val << TAMPER_LEVELA_LEVEL2_Pos) /* (TAMPER_LEVELA) Erase Flash Key Position  */
#define TAMPER_LEVELA_LEVEL3_Pos              _UINT32_(12)                                         /* (TAMPER_LEVELA) Level 3 Position */
#define TAMPER_LEVELA_LEVEL3_Msk              (_UINT32_(0xF) << TAMPER_LEVELA_LEVEL3_Pos)          /* (TAMPER_LEVELA) Level 3 Mask */
#define TAMPER_LEVELA_LEVEL3(value)           (TAMPER_LEVELA_LEVEL3_Msk & (_UINT32_(value) << TAMPER_LEVELA_LEVEL3_Pos)) /* Assigment of value for LEVEL3 in the TAMPER_LEVELA register */
#define   TAMPER_LEVELA_LEVEL3_NONE_Val       _UINT32_(0x0)                                        /* (TAMPER_LEVELA) No Action  */
#define   TAMPER_LEVELA_LEVEL3_HOSTIRQ_Val    _UINT32_(0x1)                                        /* (TAMPER_LEVELA) Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL3_LEHIRQ_Val     _UINT32_(0x2)                                        /* (TAMPER_LEVELA) Log Event and Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL3_SAFEMODE_Val   _UINT32_(0x4)                                        /* (TAMPER_LEVELA) Enter Safe Mode  */
#define   TAMPER_LEVELA_LEVEL3_ERSTKEY_Val    _UINT32_(0x5)                                        /* (TAMPER_LEVELA) Erase Tamper Key  */
#define   TAMPER_LEVELA_LEVEL3_ERSFKEY_Val    _UINT32_(0x6)                                        /* (TAMPER_LEVELA) Erase Flash Key  */
#define TAMPER_LEVELA_LEVEL3_NONE             (TAMPER_LEVELA_LEVEL3_NONE_Val << TAMPER_LEVELA_LEVEL3_Pos) /* (TAMPER_LEVELA) No Action Position  */
#define TAMPER_LEVELA_LEVEL3_HOSTIRQ          (TAMPER_LEVELA_LEVEL3_HOSTIRQ_Val << TAMPER_LEVELA_LEVEL3_Pos) /* (TAMPER_LEVELA) Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL3_LEHIRQ           (TAMPER_LEVELA_LEVEL3_LEHIRQ_Val << TAMPER_LEVELA_LEVEL3_Pos) /* (TAMPER_LEVELA) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL3_SAFEMODE         (TAMPER_LEVELA_LEVEL3_SAFEMODE_Val << TAMPER_LEVELA_LEVEL3_Pos) /* (TAMPER_LEVELA) Enter Safe Mode Position  */
#define TAMPER_LEVELA_LEVEL3_ERSTKEY          (TAMPER_LEVELA_LEVEL3_ERSTKEY_Val << TAMPER_LEVELA_LEVEL3_Pos) /* (TAMPER_LEVELA) Erase Tamper Key Position  */
#define TAMPER_LEVELA_LEVEL3_ERSFKEY          (TAMPER_LEVELA_LEVEL3_ERSFKEY_Val << TAMPER_LEVELA_LEVEL3_Pos) /* (TAMPER_LEVELA) Erase Flash Key Position  */
#define TAMPER_LEVELA_LEVEL4_Pos              _UINT32_(16)                                         /* (TAMPER_LEVELA) Level 4 Position */
#define TAMPER_LEVELA_LEVEL4_Msk              (_UINT32_(0xF) << TAMPER_LEVELA_LEVEL4_Pos)          /* (TAMPER_LEVELA) Level 4 Mask */
#define TAMPER_LEVELA_LEVEL4(value)           (TAMPER_LEVELA_LEVEL4_Msk & (_UINT32_(value) << TAMPER_LEVELA_LEVEL4_Pos)) /* Assigment of value for LEVEL4 in the TAMPER_LEVELA register */
#define   TAMPER_LEVELA_LEVEL4_NONE_Val       _UINT32_(0x0)                                        /* (TAMPER_LEVELA) No Action  */
#define   TAMPER_LEVELA_LEVEL4_HOSTIRQ_Val    _UINT32_(0x1)                                        /* (TAMPER_LEVELA) Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL4_LEHIRQ_Val     _UINT32_(0x2)                                        /* (TAMPER_LEVELA) Log Event and Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL4_SAFEMODE_Val   _UINT32_(0x4)                                        /* (TAMPER_LEVELA) Enter Safe Mode  */
#define   TAMPER_LEVELA_LEVEL4_ERSTKEY_Val    _UINT32_(0x5)                                        /* (TAMPER_LEVELA) Erase Tamper Key  */
#define   TAMPER_LEVELA_LEVEL4_ERSFKEY_Val    _UINT32_(0x6)                                        /* (TAMPER_LEVELA) Erase Flash Key  */
#define TAMPER_LEVELA_LEVEL4_NONE             (TAMPER_LEVELA_LEVEL4_NONE_Val << TAMPER_LEVELA_LEVEL4_Pos) /* (TAMPER_LEVELA) No Action Position  */
#define TAMPER_LEVELA_LEVEL4_HOSTIRQ          (TAMPER_LEVELA_LEVEL4_HOSTIRQ_Val << TAMPER_LEVELA_LEVEL4_Pos) /* (TAMPER_LEVELA) Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL4_LEHIRQ           (TAMPER_LEVELA_LEVEL4_LEHIRQ_Val << TAMPER_LEVELA_LEVEL4_Pos) /* (TAMPER_LEVELA) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL4_SAFEMODE         (TAMPER_LEVELA_LEVEL4_SAFEMODE_Val << TAMPER_LEVELA_LEVEL4_Pos) /* (TAMPER_LEVELA) Enter Safe Mode Position  */
#define TAMPER_LEVELA_LEVEL4_ERSTKEY          (TAMPER_LEVELA_LEVEL4_ERSTKEY_Val << TAMPER_LEVELA_LEVEL4_Pos) /* (TAMPER_LEVELA) Erase Tamper Key Position  */
#define TAMPER_LEVELA_LEVEL4_ERSFKEY          (TAMPER_LEVELA_LEVEL4_ERSFKEY_Val << TAMPER_LEVELA_LEVEL4_Pos) /* (TAMPER_LEVELA) Erase Flash Key Position  */
#define TAMPER_LEVELA_LEVEL5_Pos              _UINT32_(20)                                         /* (TAMPER_LEVELA) Level 5 Position */
#define TAMPER_LEVELA_LEVEL5_Msk              (_UINT32_(0xF) << TAMPER_LEVELA_LEVEL5_Pos)          /* (TAMPER_LEVELA) Level 5 Mask */
#define TAMPER_LEVELA_LEVEL5(value)           (TAMPER_LEVELA_LEVEL5_Msk & (_UINT32_(value) << TAMPER_LEVELA_LEVEL5_Pos)) /* Assigment of value for LEVEL5 in the TAMPER_LEVELA register */
#define   TAMPER_LEVELA_LEVEL5_NONE_Val       _UINT32_(0x0)                                        /* (TAMPER_LEVELA) No Action  */
#define   TAMPER_LEVELA_LEVEL5_HOSTIRQ_Val    _UINT32_(0x1)                                        /* (TAMPER_LEVELA) Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL5_LEHIRQ_Val     _UINT32_(0x2)                                        /* (TAMPER_LEVELA) Log Event and Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL5_SAFEMODE_Val   _UINT32_(0x4)                                        /* (TAMPER_LEVELA) Enter Safe Mode  */
#define   TAMPER_LEVELA_LEVEL5_ERSTKEY_Val    _UINT32_(0x5)                                        /* (TAMPER_LEVELA) Erase Tamper Key  */
#define   TAMPER_LEVELA_LEVEL5_ERSFKEY_Val    _UINT32_(0x6)                                        /* (TAMPER_LEVELA) Erase Flash Key  */
#define TAMPER_LEVELA_LEVEL5_NONE             (TAMPER_LEVELA_LEVEL5_NONE_Val << TAMPER_LEVELA_LEVEL5_Pos) /* (TAMPER_LEVELA) No Action Position  */
#define TAMPER_LEVELA_LEVEL5_HOSTIRQ          (TAMPER_LEVELA_LEVEL5_HOSTIRQ_Val << TAMPER_LEVELA_LEVEL5_Pos) /* (TAMPER_LEVELA) Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL5_LEHIRQ           (TAMPER_LEVELA_LEVEL5_LEHIRQ_Val << TAMPER_LEVELA_LEVEL5_Pos) /* (TAMPER_LEVELA) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL5_SAFEMODE         (TAMPER_LEVELA_LEVEL5_SAFEMODE_Val << TAMPER_LEVELA_LEVEL5_Pos) /* (TAMPER_LEVELA) Enter Safe Mode Position  */
#define TAMPER_LEVELA_LEVEL5_ERSTKEY          (TAMPER_LEVELA_LEVEL5_ERSTKEY_Val << TAMPER_LEVELA_LEVEL5_Pos) /* (TAMPER_LEVELA) Erase Tamper Key Position  */
#define TAMPER_LEVELA_LEVEL5_ERSFKEY          (TAMPER_LEVELA_LEVEL5_ERSFKEY_Val << TAMPER_LEVELA_LEVEL5_Pos) /* (TAMPER_LEVELA) Erase Flash Key Position  */
#define TAMPER_LEVELA_LEVEL6_Pos              _UINT32_(24)                                         /* (TAMPER_LEVELA) Level 6 Position */
#define TAMPER_LEVELA_LEVEL6_Msk              (_UINT32_(0xF) << TAMPER_LEVELA_LEVEL6_Pos)          /* (TAMPER_LEVELA) Level 6 Mask */
#define TAMPER_LEVELA_LEVEL6(value)           (TAMPER_LEVELA_LEVEL6_Msk & (_UINT32_(value) << TAMPER_LEVELA_LEVEL6_Pos)) /* Assigment of value for LEVEL6 in the TAMPER_LEVELA register */
#define   TAMPER_LEVELA_LEVEL6_NONE_Val       _UINT32_(0x0)                                        /* (TAMPER_LEVELA) No Action  */
#define   TAMPER_LEVELA_LEVEL6_HOSTIRQ_Val    _UINT32_(0x1)                                        /* (TAMPER_LEVELA) Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL6_LEHIRQ_Val     _UINT32_(0x2)                                        /* (TAMPER_LEVELA) Log Event and Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL6_SAFEMODE_Val   _UINT32_(0x4)                                        /* (TAMPER_LEVELA) Enter Safe Mode  */
#define   TAMPER_LEVELA_LEVEL6_ERSTKEY_Val    _UINT32_(0x5)                                        /* (TAMPER_LEVELA) Erase Tamper Key  */
#define   TAMPER_LEVELA_LEVEL6_ERSFKEY_Val    _UINT32_(0x6)                                        /* (TAMPER_LEVELA) Erase Flash Key  */
#define TAMPER_LEVELA_LEVEL6_NONE             (TAMPER_LEVELA_LEVEL6_NONE_Val << TAMPER_LEVELA_LEVEL6_Pos) /* (TAMPER_LEVELA) No Action Position  */
#define TAMPER_LEVELA_LEVEL6_HOSTIRQ          (TAMPER_LEVELA_LEVEL6_HOSTIRQ_Val << TAMPER_LEVELA_LEVEL6_Pos) /* (TAMPER_LEVELA) Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL6_LEHIRQ           (TAMPER_LEVELA_LEVEL6_LEHIRQ_Val << TAMPER_LEVELA_LEVEL6_Pos) /* (TAMPER_LEVELA) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL6_SAFEMODE         (TAMPER_LEVELA_LEVEL6_SAFEMODE_Val << TAMPER_LEVELA_LEVEL6_Pos) /* (TAMPER_LEVELA) Enter Safe Mode Position  */
#define TAMPER_LEVELA_LEVEL6_ERSTKEY          (TAMPER_LEVELA_LEVEL6_ERSTKEY_Val << TAMPER_LEVELA_LEVEL6_Pos) /* (TAMPER_LEVELA) Erase Tamper Key Position  */
#define TAMPER_LEVELA_LEVEL6_ERSFKEY          (TAMPER_LEVELA_LEVEL6_ERSFKEY_Val << TAMPER_LEVELA_LEVEL6_Pos) /* (TAMPER_LEVELA) Erase Flash Key Position  */
#define TAMPER_LEVELA_LEVEL7_Pos              _UINT32_(28)                                         /* (TAMPER_LEVELA) Level 7 Position */
#define TAMPER_LEVELA_LEVEL7_Msk              (_UINT32_(0xF) << TAMPER_LEVELA_LEVEL7_Pos)          /* (TAMPER_LEVELA) Level 7 Mask */
#define TAMPER_LEVELA_LEVEL7(value)           (TAMPER_LEVELA_LEVEL7_Msk & (_UINT32_(value) << TAMPER_LEVELA_LEVEL7_Pos)) /* Assigment of value for LEVEL7 in the TAMPER_LEVELA register */
#define   TAMPER_LEVELA_LEVEL7_NONE_Val       _UINT32_(0x0)                                        /* (TAMPER_LEVELA) No Action  */
#define   TAMPER_LEVELA_LEVEL7_HOSTIRQ_Val    _UINT32_(0x1)                                        /* (TAMPER_LEVELA) Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL7_LEHIRQ_Val     _UINT32_(0x2)                                        /* (TAMPER_LEVELA) Log Event and Host Interrupt  */
#define   TAMPER_LEVELA_LEVEL7_SAFEMODE_Val   _UINT32_(0x4)                                        /* (TAMPER_LEVELA) Enter Safe Mode  */
#define   TAMPER_LEVELA_LEVEL7_ERSTKEY_Val    _UINT32_(0x5)                                        /* (TAMPER_LEVELA) Erase Tamper Key  */
#define   TAMPER_LEVELA_LEVEL7_ERSFKEY_Val    _UINT32_(0x6)                                        /* (TAMPER_LEVELA) Erase Flash Key  */
#define TAMPER_LEVELA_LEVEL7_NONE             (TAMPER_LEVELA_LEVEL7_NONE_Val << TAMPER_LEVELA_LEVEL7_Pos) /* (TAMPER_LEVELA) No Action Position  */
#define TAMPER_LEVELA_LEVEL7_HOSTIRQ          (TAMPER_LEVELA_LEVEL7_HOSTIRQ_Val << TAMPER_LEVELA_LEVEL7_Pos) /* (TAMPER_LEVELA) Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL7_LEHIRQ           (TAMPER_LEVELA_LEVEL7_LEHIRQ_Val << TAMPER_LEVELA_LEVEL7_Pos) /* (TAMPER_LEVELA) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELA_LEVEL7_SAFEMODE         (TAMPER_LEVELA_LEVEL7_SAFEMODE_Val << TAMPER_LEVELA_LEVEL7_Pos) /* (TAMPER_LEVELA) Enter Safe Mode Position  */
#define TAMPER_LEVELA_LEVEL7_ERSTKEY          (TAMPER_LEVELA_LEVEL7_ERSTKEY_Val << TAMPER_LEVELA_LEVEL7_Pos) /* (TAMPER_LEVELA) Erase Tamper Key Position  */
#define TAMPER_LEVELA_LEVEL7_ERSFKEY          (TAMPER_LEVELA_LEVEL7_ERSFKEY_Val << TAMPER_LEVELA_LEVEL7_Pos) /* (TAMPER_LEVELA) Erase Flash Key Position  */
#define TAMPER_LEVELA_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (TAMPER_LEVELA) Register Mask  */


/* -------- TAMPER_LEVELB : (TAMPER Offset: 0x04) ( R/ 32) Level B -------- */
#define TAMPER_LEVELB_RESETVALUE              _UINT32_(0x11111111)                                 /*  (TAMPER_LEVELB) Level B  Reset Value */

