Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/include/component/tamper.h
#define TAMPER_LEVELC_LEVEL16_Pos             _UINT32_(0)                                          /* (TAMPER_LEVELC) Level 16 Position */
#define TAMPER_LEVELC_LEVEL16_Msk             (_UINT32_(0xF) << TAMPER_LEVELC_LEVEL16_Pos)         /* (TAMPER_LEVELC) Level 16 Mask */
#define TAMPER_LEVELC_LEVEL16(value)          (TAMPER_LEVELC_LEVEL16_Msk & (_UINT32_(value) << TAMPER_LEVELC_LEVEL16_Pos)) /* Assigment of value for LEVEL16 in the TAMPER_LEVELC register */
#define   TAMPER_LEVELC_LEVEL16_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELC) No Action  */
#define   TAMPER_LEVELC_LEVEL16_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELC) Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL16_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELC) Log Event and Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL16_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELC) Enter Safe Mode  */
#define   TAMPER_LEVELC_LEVEL16_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELC) Erase Tamper Key  */
#define   TAMPER_LEVELC_LEVEL16_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELC) Erase Flash Key  */
#define TAMPER_LEVELC_LEVEL16_NONE            (TAMPER_LEVELC_LEVEL16_NONE_Val << TAMPER_LEVELC_LEVEL16_Pos) /* (TAMPER_LEVELC) No Action Position  */
#define TAMPER_LEVELC_LEVEL16_HOSTIRQ         (TAMPER_LEVELC_LEVEL16_HOSTIRQ_Val << TAMPER_LEVELC_LEVEL16_Pos) /* (TAMPER_LEVELC) Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL16_LEHIRQ          (TAMPER_LEVELC_LEVEL16_LEHIRQ_Val << TAMPER_LEVELC_LEVEL16_Pos) /* (TAMPER_LEVELC) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL16_SAFEMODE        (TAMPER_LEVELC_LEVEL16_SAFEMODE_Val << TAMPER_LEVELC_LEVEL16_Pos) /* (TAMPER_LEVELC) Enter Safe Mode Position  */
#define TAMPER_LEVELC_LEVEL16_ERSTKEY         (TAMPER_LEVELC_LEVEL16_ERSTKEY_Val << TAMPER_LEVELC_LEVEL16_Pos) /* (TAMPER_LEVELC) Erase Tamper Key Position  */
#define TAMPER_LEVELC_LEVEL16_ERSFKEY         (TAMPER_LEVELC_LEVEL16_ERSFKEY_Val << TAMPER_LEVELC_LEVEL16_Pos) /* (TAMPER_LEVELC) Erase Flash Key Position  */
#define TAMPER_LEVELC_LEVEL17_Pos             _UINT32_(4)                                          /* (TAMPER_LEVELC) Level 17 Position */
#define TAMPER_LEVELC_LEVEL17_Msk             (_UINT32_(0xF) << TAMPER_LEVELC_LEVEL17_Pos)         /* (TAMPER_LEVELC) Level 17 Mask */
#define TAMPER_LEVELC_LEVEL17(value)          (TAMPER_LEVELC_LEVEL17_Msk & (_UINT32_(value) << TAMPER_LEVELC_LEVEL17_Pos)) /* Assigment of value for LEVEL17 in the TAMPER_LEVELC register */
#define   TAMPER_LEVELC_LEVEL17_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELC) No Action  */
#define   TAMPER_LEVELC_LEVEL17_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELC) Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL17_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELC) Log Event and Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL17_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELC) Enter Safe Mode  */
#define   TAMPER_LEVELC_LEVEL17_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELC) Erase Tamper Key  */
#define   TAMPER_LEVELC_LEVEL17_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELC) Erase Flash Key  */
#define TAMPER_LEVELC_LEVEL17_NONE            (TAMPER_LEVELC_LEVEL17_NONE_Val << TAMPER_LEVELC_LEVEL17_Pos) /* (TAMPER_LEVELC) No Action Position  */
#define TAMPER_LEVELC_LEVEL17_HOSTIRQ         (TAMPER_LEVELC_LEVEL17_HOSTIRQ_Val << TAMPER_LEVELC_LEVEL17_Pos) /* (TAMPER_LEVELC) Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL17_LEHIRQ          (TAMPER_LEVELC_LEVEL17_LEHIRQ_Val << TAMPER_LEVELC_LEVEL17_Pos) /* (TAMPER_LEVELC) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL17_SAFEMODE        (TAMPER_LEVELC_LEVEL17_SAFEMODE_Val << TAMPER_LEVELC_LEVEL17_Pos) /* (TAMPER_LEVELC) Enter Safe Mode Position  */
#define TAMPER_LEVELC_LEVEL17_ERSTKEY         (TAMPER_LEVELC_LEVEL17_ERSTKEY_Val << TAMPER_LEVELC_LEVEL17_Pos) /* (TAMPER_LEVELC) Erase Tamper Key Position  */
#define TAMPER_LEVELC_LEVEL17_ERSFKEY         (TAMPER_LEVELC_LEVEL17_ERSFKEY_Val << TAMPER_LEVELC_LEVEL17_Pos) /* (TAMPER_LEVELC) Erase Flash Key Position  */
#define TAMPER_LEVELC_LEVEL18_Pos             _UINT32_(8)                                          /* (TAMPER_LEVELC) Level 18 Position */
#define TAMPER_LEVELC_LEVEL18_Msk             (_UINT32_(0xF) << TAMPER_LEVELC_LEVEL18_Pos)         /* (TAMPER_LEVELC) Level 18 Mask */
#define TAMPER_LEVELC_LEVEL18(value)          (TAMPER_LEVELC_LEVEL18_Msk & (_UINT32_(value) << TAMPER_LEVELC_LEVEL18_Pos)) /* Assigment of value for LEVEL18 in the TAMPER_LEVELC register */
#define   TAMPER_LEVELC_LEVEL18_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELC) No Action  */
#define   TAMPER_LEVELC_LEVEL18_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELC) Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL18_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELC) Log Event and Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL18_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELC) Enter Safe Mode  */
#define   TAMPER_LEVELC_LEVEL18_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELC) Erase Tamper Key  */
#define   TAMPER_LEVELC_LEVEL18_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELC) Erase Flash Key  */
#define TAMPER_LEVELC_LEVEL18_NONE            (TAMPER_LEVELC_LEVEL18_NONE_Val << TAMPER_LEVELC_LEVEL18_Pos) /* (TAMPER_LEVELC) No Action Position  */
#define TAMPER_LEVELC_LEVEL18_HOSTIRQ         (TAMPER_LEVELC_LEVEL18_HOSTIRQ_Val << TAMPER_LEVELC_LEVEL18_Pos) /* (TAMPER_LEVELC) Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL18_LEHIRQ          (TAMPER_LEVELC_LEVEL18_LEHIRQ_Val << TAMPER_LEVELC_LEVEL18_Pos) /* (TAMPER_LEVELC) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL18_SAFEMODE        (TAMPER_LEVELC_LEVEL18_SAFEMODE_Val << TAMPER_LEVELC_LEVEL18_Pos) /* (TAMPER_LEVELC) Enter Safe Mode Position  */
#define TAMPER_LEVELC_LEVEL18_ERSTKEY         (TAMPER_LEVELC_LEVEL18_ERSTKEY_Val << TAMPER_LEVELC_LEVEL18_Pos) /* (TAMPER_LEVELC) Erase Tamper Key Position  */
#define TAMPER_LEVELC_LEVEL18_ERSFKEY         (TAMPER_LEVELC_LEVEL18_ERSFKEY_Val << TAMPER_LEVELC_LEVEL18_Pos) /* (TAMPER_LEVELC) Erase Flash Key Position  */
#define TAMPER_LEVELC_LEVEL19_Pos             _UINT32_(12)                                         /* (TAMPER_LEVELC) Level 19 Position */
#define TAMPER_LEVELC_LEVEL19_Msk             (_UINT32_(0xF) << TAMPER_LEVELC_LEVEL19_Pos)         /* (TAMPER_LEVELC) Level 19 Mask */
#define TAMPER_LEVELC_LEVEL19(value)          (TAMPER_LEVELC_LEVEL19_Msk & (_UINT32_(value) << TAMPER_LEVELC_LEVEL19_Pos)) /* Assigment of value for LEVEL19 in the TAMPER_LEVELC register */
#define   TAMPER_LEVELC_LEVEL19_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELC) No Action  */
#define   TAMPER_LEVELC_LEVEL19_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELC) Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL19_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELC) Log Event and Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL19_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELC) Enter Safe Mode  */
#define   TAMPER_LEVELC_LEVEL19_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELC) Erase Tamper Key  */
#define   TAMPER_LEVELC_LEVEL19_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELC) Erase Flash Key  */
#define TAMPER_LEVELC_LEVEL19_NONE            (TAMPER_LEVELC_LEVEL19_NONE_Val << TAMPER_LEVELC_LEVEL19_Pos) /* (TAMPER_LEVELC) No Action Position  */
#define TAMPER_LEVELC_LEVEL19_HOSTIRQ         (TAMPER_LEVELC_LEVEL19_HOSTIRQ_Val << TAMPER_LEVELC_LEVEL19_Pos) /* (TAMPER_LEVELC) Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL19_LEHIRQ          (TAMPER_LEVELC_LEVEL19_LEHIRQ_Val << TAMPER_LEVELC_LEVEL19_Pos) /* (TAMPER_LEVELC) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL19_SAFEMODE        (TAMPER_LEVELC_LEVEL19_SAFEMODE_Val << TAMPER_LEVELC_LEVEL19_Pos) /* (TAMPER_LEVELC) Enter Safe Mode Position  */
#define TAMPER_LEVELC_LEVEL19_ERSTKEY         (TAMPER_LEVELC_LEVEL19_ERSTKEY_Val << TAMPER_LEVELC_LEVEL19_Pos) /* (TAMPER_LEVELC) Erase Tamper Key Position  */
#define TAMPER_LEVELC_LEVEL19_ERSFKEY         (TAMPER_LEVELC_LEVEL19_ERSFKEY_Val << TAMPER_LEVELC_LEVEL19_Pos) /* (TAMPER_LEVELC) Erase Flash Key Position  */
#define TAMPER_LEVELC_LEVEL20_Pos             _UINT32_(16)                                         /* (TAMPER_LEVELC) Level 20 Position */
#define TAMPER_LEVELC_LEVEL20_Msk             (_UINT32_(0xF) << TAMPER_LEVELC_LEVEL20_Pos)         /* (TAMPER_LEVELC) Level 20 Mask */
#define TAMPER_LEVELC_LEVEL20(value)          (TAMPER_LEVELC_LEVEL20_Msk & (_UINT32_(value) << TAMPER_LEVELC_LEVEL20_Pos)) /* Assigment of value for LEVEL20 in the TAMPER_LEVELC register */
#define   TAMPER_LEVELC_LEVEL20_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELC) No Action  */
#define   TAMPER_LEVELC_LEVEL20_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELC) Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL20_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELC) Log Event and Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL20_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELC) Enter Safe Mode  */
#define   TAMPER_LEVELC_LEVEL20_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELC) Erase Tamper Key  */
#define   TAMPER_LEVELC_LEVEL20_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELC) Erase Flash Key  */
#define TAMPER_LEVELC_LEVEL20_NONE            (TAMPER_LEVELC_LEVEL20_NONE_Val << TAMPER_LEVELC_LEVEL20_Pos) /* (TAMPER_LEVELC) No Action Position  */
#define TAMPER_LEVELC_LEVEL20_HOSTIRQ         (TAMPER_LEVELC_LEVEL20_HOSTIRQ_Val << TAMPER_LEVELC_LEVEL20_Pos) /* (TAMPER_LEVELC) Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL20_LEHIRQ          (TAMPER_LEVELC_LEVEL20_LEHIRQ_Val << TAMPER_LEVELC_LEVEL20_Pos) /* (TAMPER_LEVELC) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL20_SAFEMODE        (TAMPER_LEVELC_LEVEL20_SAFEMODE_Val << TAMPER_LEVELC_LEVEL20_Pos) /* (TAMPER_LEVELC) Enter Safe Mode Position  */
#define TAMPER_LEVELC_LEVEL20_ERSTKEY         (TAMPER_LEVELC_LEVEL20_ERSTKEY_Val << TAMPER_LEVELC_LEVEL20_Pos) /* (TAMPER_LEVELC) Erase Tamper Key Position  */
#define TAMPER_LEVELC_LEVEL20_ERSFKEY         (TAMPER_LEVELC_LEVEL20_ERSFKEY_Val << TAMPER_LEVELC_LEVEL20_Pos) /* (TAMPER_LEVELC) Erase Flash Key Position  */
#define TAMPER_LEVELC_LEVEL21_Pos             _UINT32_(20)                                         /* (TAMPER_LEVELC) Level 21 Position */
#define TAMPER_LEVELC_LEVEL21_Msk             (_UINT32_(0xF) << TAMPER_LEVELC_LEVEL21_Pos)         /* (TAMPER_LEVELC) Level 21 Mask */
#define TAMPER_LEVELC_LEVEL21(value)          (TAMPER_LEVELC_LEVEL21_Msk & (_UINT32_(value) << TAMPER_LEVELC_LEVEL21_Pos)) /* Assigment of value for LEVEL21 in the TAMPER_LEVELC register */
#define   TAMPER_LEVELC_LEVEL21_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELC) No Action  */
#define   TAMPER_LEVELC_LEVEL21_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELC) Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL21_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELC) Log Event and Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL21_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELC) Enter Safe Mode  */
#define   TAMPER_LEVELC_LEVEL21_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELC) Erase Tamper Key  */
#define   TAMPER_LEVELC_LEVEL21_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELC) Erase Flash Key  */
#define TAMPER_LEVELC_LEVEL21_NONE            (TAMPER_LEVELC_LEVEL21_NONE_Val << TAMPER_LEVELC_LEVEL21_Pos) /* (TAMPER_LEVELC) No Action Position  */
#define TAMPER_LEVELC_LEVEL21_HOSTIRQ         (TAMPER_LEVELC_LEVEL21_HOSTIRQ_Val << TAMPER_LEVELC_LEVEL21_Pos) /* (TAMPER_LEVELC) Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL21_LEHIRQ          (TAMPER_LEVELC_LEVEL21_LEHIRQ_Val << TAMPER_LEVELC_LEVEL21_Pos) /* (TAMPER_LEVELC) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL21_SAFEMODE        (TAMPER_LEVELC_LEVEL21_SAFEMODE_Val << TAMPER_LEVELC_LEVEL21_Pos) /* (TAMPER_LEVELC) Enter Safe Mode Position  */
#define TAMPER_LEVELC_LEVEL21_ERSTKEY         (TAMPER_LEVELC_LEVEL21_ERSTKEY_Val << TAMPER_LEVELC_LEVEL21_Pos) /* (TAMPER_LEVELC) Erase Tamper Key Position  */
#define TAMPER_LEVELC_LEVEL21_ERSFKEY         (TAMPER_LEVELC_LEVEL21_ERSFKEY_Val << TAMPER_LEVELC_LEVEL21_Pos) /* (TAMPER_LEVELC) Erase Flash Key Position  */
#define TAMPER_LEVELC_LEVEL22_Pos             _UINT32_(24)                                         /* (TAMPER_LEVELC) Level 22 Position */
#define TAMPER_LEVELC_LEVEL22_Msk             (_UINT32_(0xF) << TAMPER_LEVELC_LEVEL22_Pos)         /* (TAMPER_LEVELC) Level 22 Mask */
#define TAMPER_LEVELC_LEVEL22(value)          (TAMPER_LEVELC_LEVEL22_Msk & (_UINT32_(value) << TAMPER_LEVELC_LEVEL22_Pos)) /* Assigment of value for LEVEL22 in the TAMPER_LEVELC register */
#define   TAMPER_LEVELC_LEVEL22_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELC) No Action  */
#define   TAMPER_LEVELC_LEVEL22_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELC) Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL22_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELC) Log Event and Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL22_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELC) Enter Safe Mode  */
#define   TAMPER_LEVELC_LEVEL22_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELC) Erase Tamper Key  */
#define   TAMPER_LEVELC_LEVEL22_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELC) Erase Flash Key  */
#define TAMPER_LEVELC_LEVEL22_NONE            (TAMPER_LEVELC_LEVEL22_NONE_Val << TAMPER_LEVELC_LEVEL22_Pos) /* (TAMPER_LEVELC) No Action Position  */
#define TAMPER_LEVELC_LEVEL22_HOSTIRQ         (TAMPER_LEVELC_LEVEL22_HOSTIRQ_Val << TAMPER_LEVELC_LEVEL22_Pos) /* (TAMPER_LEVELC) Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL22_LEHIRQ          (TAMPER_LEVELC_LEVEL22_LEHIRQ_Val << TAMPER_LEVELC_LEVEL22_Pos) /* (TAMPER_LEVELC) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL22_SAFEMODE        (TAMPER_LEVELC_LEVEL22_SAFEMODE_Val << TAMPER_LEVELC_LEVEL22_Pos) /* (TAMPER_LEVELC) Enter Safe Mode Position  */
#define TAMPER_LEVELC_LEVEL22_ERSTKEY         (TAMPER_LEVELC_LEVEL22_ERSTKEY_Val << TAMPER_LEVELC_LEVEL22_Pos) /* (TAMPER_LEVELC) Erase Tamper Key Position  */
#define TAMPER_LEVELC_LEVEL22_ERSFKEY         (TAMPER_LEVELC_LEVEL22_ERSFKEY_Val << TAMPER_LEVELC_LEVEL22_Pos) /* (TAMPER_LEVELC) Erase Flash Key Position  */
#define TAMPER_LEVELC_LEVEL23_Pos             _UINT32_(28)                                         /* (TAMPER_LEVELC) Level 23 Position */
#define TAMPER_LEVELC_LEVEL23_Msk             (_UINT32_(0xF) << TAMPER_LEVELC_LEVEL23_Pos)         /* (TAMPER_LEVELC) Level 23 Mask */
#define TAMPER_LEVELC_LEVEL23(value)          (TAMPER_LEVELC_LEVEL23_Msk & (_UINT32_(value) << TAMPER_LEVELC_LEVEL23_Pos)) /* Assigment of value for LEVEL23 in the TAMPER_LEVELC register */
#define   TAMPER_LEVELC_LEVEL23_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELC) No Action  */
#define   TAMPER_LEVELC_LEVEL23_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELC) Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL23_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELC) Log Event and Host Interrupt  */
#define   TAMPER_LEVELC_LEVEL23_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELC) Enter Safe Mode  */
#define   TAMPER_LEVELC_LEVEL23_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELC) Erase Tamper Key  */
#define   TAMPER_LEVELC_LEVEL23_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELC) Erase Flash Key  */
#define TAMPER_LEVELC_LEVEL23_NONE            (TAMPER_LEVELC_LEVEL23_NONE_Val << TAMPER_LEVELC_LEVEL23_Pos) /* (TAMPER_LEVELC) No Action Position  */
#define TAMPER_LEVELC_LEVEL23_HOSTIRQ         (TAMPER_LEVELC_LEVEL23_HOSTIRQ_Val << TAMPER_LEVELC_LEVEL23_Pos) /* (TAMPER_LEVELC) Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL23_LEHIRQ          (TAMPER_LEVELC_LEVEL23_LEHIRQ_Val << TAMPER_LEVELC_LEVEL23_Pos) /* (TAMPER_LEVELC) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELC_LEVEL23_SAFEMODE        (TAMPER_LEVELC_LEVEL23_SAFEMODE_Val << TAMPER_LEVELC_LEVEL23_Pos) /* (TAMPER_LEVELC) Enter Safe Mode Position  */
#define TAMPER_LEVELC_LEVEL23_ERSTKEY         (TAMPER_LEVELC_LEVEL23_ERSTKEY_Val << TAMPER_LEVELC_LEVEL23_Pos) /* (TAMPER_LEVELC) Erase Tamper Key Position  */
#define TAMPER_LEVELC_LEVEL23_ERSFKEY         (TAMPER_LEVELC_LEVEL23_ERSFKEY_Val << TAMPER_LEVELC_LEVEL23_Pos) /* (TAMPER_LEVELC) Erase Flash Key Position  */
#define TAMPER_LEVELC_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (TAMPER_LEVELC) Register Mask  */


