Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/include/component/tamper.h
/* -------- TAMPER_FILTERCFG : (TAMPER Offset: 0x14) (R/W 32) Filter Configuraiton -------- */
#define TAMPER_FILTERCFG_RESETVALUE           _UINT32_(0x00)                                       /*  (TAMPER_FILTERCFG) Filter Configuraiton  Reset Value */

#define TAMPER_FILTERCFG_Threshold_Pos        _UINT32_(0)                                          /* (TAMPER_FILTERCFG) Filter Threshold Position */
#define TAMPER_FILTERCFG_Threshold_Msk        (_UINT32_(0x7) << TAMPER_FILTERCFG_Threshold_Pos)    /* (TAMPER_FILTERCFG) Filter Threshold Mask */
#define TAMPER_FILTERCFG_Threshold(value)     (TAMPER_FILTERCFG_Threshold_Msk & (_UINT32_(value) << TAMPER_FILTERCFG_Threshold_Pos)) /* Assigment of value for Threshold in the TAMPER_FILTERCFG register */
#define TAMPER_FILTERCFG_Period_Pos           _UINT32_(8)                                          /* (TAMPER_FILTERCFG) Filter Period Position */
#define TAMPER_FILTERCFG_Period_Msk           (_UINT32_(0x1F) << TAMPER_FILTERCFG_Period_Pos)      /* (TAMPER_FILTERCFG) Filter Period Mask */
#define TAMPER_FILTERCFG_Period(value)        (TAMPER_FILTERCFG_Period_Msk & (_UINT32_(value) << TAMPER_FILTERCFG_Period_Pos)) /* Assigment of value for Period in the TAMPER_FILTERCFG register */
#define TAMPER_FILTERCFG_ProtectionKey_Pos    _UINT32_(16)                                         /* (TAMPER_FILTERCFG) Filter Protection Key Position */
#define TAMPER_FILTERCFG_ProtectionKey_Msk    (_UINT32_(0xFFFF) << TAMPER_FILTERCFG_ProtectionKey_Pos) /* (TAMPER_FILTERCFG) Filter Protection Key Mask */
#define TAMPER_FILTERCFG_ProtectionKey(value) (TAMPER_FILTERCFG_ProtectionKey_Msk & (_UINT32_(value) << TAMPER_FILTERCFG_ProtectionKey_Pos)) /* Assigment of value for ProtectionKey in the TAMPER_FILTERCFG register */
#define TAMPER_FILTERCFG_Msk                  _UINT32_(0xFFFF1F07)                                 /* (TAMPER_FILTERCFG) Register Mask  */


/* -------- TAMPER_SOFTTAMP : (TAMPER Offset: 0x18) (R/W 32) Soft Tamper -------- */
#define TAMPER_SOFTTAMP_RESETVALUE            _UINT32_(0x00)                                       /*  (TAMPER_SOFTTAMP) Soft Tamper  Reset Value */

#define TAMPER_SOFTTAMP_TamperActive_Pos      _UINT32_(0)                                          /* (TAMPER_SOFTTAMP) Tamper Active Position */
#define TAMPER_SOFTTAMP_TamperActive_Msk      (_UINT32_(0x1) << TAMPER_SOFTTAMP_TamperActive_Pos)  /* (TAMPER_SOFTTAMP) Tamper Active Mask */
#define TAMPER_SOFTTAMP_TamperActive(value)   (TAMPER_SOFTTAMP_TamperActive_Msk & (_UINT32_(value) << TAMPER_SOFTTAMP_TamperActive_Pos)) /* Assigment of value for TamperActive in the TAMPER_SOFTTAMP register */
#define TAMPER_SOFTTAMP_TamperID_Pos          _UINT32_(8)                                          /* (TAMPER_SOFTTAMP) Tamper ID Position */
#define TAMPER_SOFTTAMP_TamperID_Msk          (_UINT32_(0x1F) << TAMPER_SOFTTAMP_TamperID_Pos)     /* (TAMPER_SOFTTAMP) Tamper ID Mask */
#define TAMPER_SOFTTAMP_TamperID(value)       (TAMPER_SOFTTAMP_TamperID_Msk & (_UINT32_(value) << TAMPER_SOFTTAMP_TamperID_Pos)) /* Assigment of value for TamperID in the TAMPER_SOFTTAMP register */
#define TAMPER_SOFTTAMP_ProtectionKey_Pos     _UINT32_(16)                                         /* (TAMPER_SOFTTAMP) Protection Key Position */
#define TAMPER_SOFTTAMP_ProtectionKey_Msk     (_UINT32_(0xFFFF) << TAMPER_SOFTTAMP_ProtectionKey_Pos) /* (TAMPER_SOFTTAMP) Protection Key Mask */
#define TAMPER_SOFTTAMP_ProtectionKey(value)  (TAMPER_SOFTTAMP_ProtectionKey_Msk & (_UINT32_(value) << TAMPER_SOFTTAMP_ProtectionKey_Pos)) /* Assigment of value for ProtectionKey in the TAMPER_SOFTTAMP register */
#define TAMPER_SOFTTAMP_Msk                   _UINT32_(0xFFFF1F01)                                 /* (TAMPER_SOFTTAMP) Register Mask  */


/* -------- TAMPER_RAWSTAT : (TAMPER Offset: 0x1C) ( R/ 32) Raw Status -------- */
#define TAMPER_RAWSTAT_RESETVALUE             _UINT32_(0x00)                                       /*  (TAMPER_RAWSTAT) Raw Status  Reset Value */

#define TAMPER_RAWSTAT_Msk                    _UINT32_(0x00000000)                                 /* (TAMPER_RAWSTAT) Register Mask  */


/* -------- TAMPER_STAT : (TAMPER Offset: 0x20) (R/W 32) Status -------- */
#define TAMPER_STAT_RESETVALUE                _UINT32_(0x01)                                       /*  (TAMPER_STAT) Status  Reset Value */

#define TAMPER_STAT_Msk                       _UINT32_(0x00000000)                                 /* (TAMPER_STAT) Register Mask  */


/* -------- TAMPER_TIMESTAMP : (TAMPER Offset: 0x24) ( R/ 32) Time Stamp -------- */
#define TAMPER_TIMESTAMP_RESETVALUE           _UINT32_(0x00)                                       /*  (TAMPER_TIMESTAMP) Time Stamp  Reset Value */

#define TAMPER_TIMESTAMP_Msk                  _UINT32_(0x00000000)                                 /* (TAMPER_TIMESTAMP) Register Mask  */


/* -------- TAMPER_FILTERCNT : (TAMPER Offset: 0x28) ( R/ 32) Filter Count -------- */
#define TAMPER_FILTERCNT_RESETVALUE           _UINT32_(0x00)                                       /*  (TAMPER_FILTERCNT) Filter Count  Reset Value */

#define TAMPER_FILTERCNT_Msk                  _UINT32_(0x00000000)                                 /* (TAMPER_FILTERCNT) Register Mask  */


/* -------- TAMPER_SOFTINFO : (TAMPER Offset: 0x2C) (R/W 32) Soft Information -------- */
#define TAMPER_SOFTINFO_RESETVALUE            _UINT32_(0x00)                                       /*  (TAMPER_SOFTINFO) Soft Information  Reset Value */

#define TAMPER_SOFTINFO_Msk                   _UINT32_(0x00000000)                                 /* (TAMPER_SOFTINFO) Register Mask  */


/* -------- TAMPER_HOSTIRQ : (TAMPER Offset: 0x30) (R/W 32) Host Interrupt -------- */
#define TAMPER_HOSTIRQ_RESETVALUE             _UINT32_(0x00)                                       /*  (TAMPER_HOSTIRQ) Host Interrupt  Reset Value */

#define TAMPER_HOSTIRQ_Msk                    _UINT32_(0x00000000)                                 /* (TAMPER_HOSTIRQ) Register Mask  */


/* -------- TAMPER_SOFTRESET : (TAMPER Offset: 0x34) ( R/ 32) Soft Reset -------- */
#define TAMPER_SOFTRESET_RESETVALUE           _UINT32_(0x00)                                       /*  (TAMPER_SOFTRESET) Soft Reset  Reset Value */

#define TAMPER_SOFTRESET_Msk                  _UINT32_(0x00000000)                                 /* (TAMPER_SOFTRESET) Register Mask  */


/** \brief TAMPER register offsets definitions */
#define TAMPER_LEVELA_REG_OFST         _UINT32_(0x00)      /* (TAMPER_LEVELA) Level A Offset */
#define TAMPER_LEVELB_REG_OFST         _UINT32_(0x04)      /* (TAMPER_LEVELB) Level B Offset */
#define TAMPER_LEVELC_REG_OFST         _UINT32_(0x08)      /* (TAMPER_LEVELC) Level C Offset */
#define TAMPER_LEVELD_REG_OFST         _UINT32_(0x0C)      /* (TAMPER_LEVELD) Level D Offset */
#define TAMPER_SETLEVEL_REG_OFST       _UINT32_(0x10)      /* (TAMPER_SETLEVEL) Set Level Offset */
#define TAMPER_FILTERCFG_REG_OFST      _UINT32_(0x14)      /* (TAMPER_FILTERCFG) Filter Configuraiton Offset */
#define TAMPER_SOFTTAMP_REG_OFST       _UINT32_(0x18)      /* (TAMPER_SOFTTAMP) Soft Tamper Offset */
#define TAMPER_RAWSTAT_REG_OFST        _UINT32_(0x1C)      /* (TAMPER_RAWSTAT) Raw Status Offset */
#define TAMPER_STAT_REG_OFST           _UINT32_(0x20)      /* (TAMPER_STAT) Status Offset */
#define TAMPER_TIMESTAMP_REG_OFST      _UINT32_(0x24)      /* (TAMPER_TIMESTAMP) Time Stamp Offset */
#define TAMPER_FILTERCNT_REG_OFST      _UINT32_(0x28)      /* (TAMPER_FILTERCNT) Filter Count Offset */
#define TAMPER_SOFTINFO_REG_OFST       _UINT32_(0x2C)      /* (TAMPER_SOFTINFO) Soft Information Offset */
#define TAMPER_HOSTIRQ_REG_OFST        _UINT32_(0x30)      /* (TAMPER_HOSTIRQ) Host Interrupt Offset */
#define TAMPER_SOFTRESET_REG_OFST      _UINT32_(0x34)      /* (TAMPER_SOFTRESET) Soft Reset Offset */

