Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/include/component/tamper.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief TAMPER register API structure */
typedef struct
{  /* eSecure IP Core Anti-tampering */
  __I   uint32_t                       TAMPER_LEVELA;      /**< Offset: 0x00 (R/   32) Level A */
  __I   uint32_t                       TAMPER_LEVELB;      /**< Offset: 0x04 (R/   32) Level B */
  __I   uint32_t                       TAMPER_LEVELC;      /**< Offset: 0x08 (R/   32) Level C */
  __I   uint32_t                       TAMPER_LEVELD;      /**< Offset: 0x0C (R/   32) Level D */
  __O   uint32_t                       TAMPER_SETLEVEL;    /**< Offset: 0x10 ( /W  32) Set Level */
  __IO  uint32_t                       TAMPER_FILTERCFG;   /**< Offset: 0x14 (R/W  32) Filter Configuraiton */
  __IO  uint32_t                       TAMPER_SOFTTAMP;    /**< Offset: 0x18 (R/W  32) Soft Tamper */
  __I   uint32_t                       TAMPER_RAWSTAT;     /**< Offset: 0x1C (R/   32) Raw Status */
  __IO  uint32_t                       TAMPER_STAT;        /**< Offset: 0x20 (R/W  32) Status */
  __I   uint32_t                       TAMPER_TIMESTAMP;   /**< Offset: 0x24 (R/   32) Time Stamp */
  __I   uint32_t                       TAMPER_FILTERCNT;   /**< Offset: 0x28 (R/   32) Filter Count */
  __IO  uint32_t                       TAMPER_SOFTINFO;    /**< Offset: 0x2C (R/W  32) Soft Information */
  __IO  uint32_t                       TAMPER_HOSTIRQ;     /**< Offset: 0x30 (R/W  32) Host Interrupt */
  __I   uint32_t                       TAMPER_SOFTRESET;   /**< Offset: 0x34 (R/   32) Soft Reset */
} tamper_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CZCA90_TAMPER_COMPONENT_H_ */
